MusaMahmood/nRF52_ADS1299_ExG/main.c
  // Build advertising data struct to pass into @ref ble_advertising_init.
  memset(&advdata, 0, sizeof(advdata));

  advdata.name_type = BLE_ADVDATA_FULL_NAME;
  advdata.include_appearance = true;
  advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
  advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
  advdata.uuids_complete.p_uuids = m_adv_uuids;

  memset(&options, 0, sizeof(options));
  options.ble_adv_fast_enabled = true;
  options.ble_adv_fast_interval = APP_ADV_INTERVAL;
  options.ble_adv_fast_timeout = APP_ADV_TIMEOUT_IN_SECONDS;

  err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, NULL);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool *p_erase_bonds) {
  ret_code_t err_code;
  bsp_event_t startup_event;

  err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, bsp_event_handler);
  APP_ERROR_CHECK(err_code);

  err_code = bsp_btn_ble_init(NULL, &startup_event);
  APP_ERROR_CHECK(err_code);

  *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

/**@brief Function for initializing the nrf log module.
 */
static void log_init(void) {
  ret_code_t err_code = NRF_LOG_INIT(NULL);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Power manager.
 */
static void power_manage(void) {
  ret_code_t err_code = sd_app_evt_wait();
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds) {
  if (erase_bonds == true) {
    delete_bonds();
    // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED evetnt
  } else {
    ret_code_t err_code = ble_advertising_start(BLE_ADV_MODE_FAST);

    APP_ERROR_CHECK(err_code);
  }
}

#if defined(ADS1299)

void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action) {
  UNUSED_PARAMETER(pin);
  UNUSED_PARAMETER(action);
  m_drdy = true;
}

static void ads1299_gpio_init(void) {
#if defined(BOARD_PCA10040)
  nrf_gpio_cfg_output(LED_1);
  nrf_gpio_cfg_output(LED_2);
  nrf_gpio_cfg_output(LED_3);
  nrf_gpio_cfg_output(LED_4);
#endif

#if defined(BOARD_NRF_BREAKOUT) | defined(BOARD_PCA10028) | defined(BOARD_PCA10040)
  nrf_gpio_pin_dir_set(ADS1299_DRDY_PIN, NRF_GPIO_PIN_DIR_INPUT); //sets 'direction' = input/output
  nrf_gpio_pin_dir_set(ADS1299_PWDN_RST_PIN, NRF_GPIO_PIN_DIR_OUTPUT);
#endif
  uint32_t err_code;
  if (!nrf_drv_gpiote_is_init()) {
    err_code = nrf_drv_gpiote_init();
  }
  NRF_LOG_INFO("nrf_drv_gpiote_init: %d\r\n", err_code);
  APP_ERROR_CHECK(err_code);
  bool is_high_accuracy = true;
  nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(is_high_accuracy);
  in_config.is_watcher = true;
  in_config.pull = NRF_GPIO_PIN_NOPULL;
  err_code = nrf_drv_gpiote_in_init(ADS1299_DRDY_PIN, &in_config, in_pin_handler);
  NRF_LOG_INFO(" nrf_drv_gpiote_in_init: %d: \r\n", err_code);
  APP_ERROR_CHECK(err_code);
  nrf_drv_gpiote_in_event_enable(ADS1299_DRDY_PIN, true);
  ads1299_powerdn();
}
#endif /* defined(ADS1299) */

/**@brief Function for application main entry.
 */
int main(void) {
  bool erase_bonds = false;
  // Initialize.
  log_init();
  timers_init();
  //buttons_leds_init(&erase_bonds);
  ble_stack_init();
#if defined(ADS1299)
  ads1299_gpio_init();
#endif
  gap_params_init();
  gatt_init();
  advertising_init();
  services_init();
  conn_params_init();
  peer_manager_init();
#if defined(ADS1299)
  ads_spi_init();
  nrf_delay_ms(5);
  ads1299_powerdn();
  ads1299_powerup();
  ads1299_stop_rdatac();
  ads1299_init_regs();
  ads1299_soft_start_conversion();
  ads1299_check_id();
  ads1299_start_rdatac();
  ads1299_standby();
  nrf_delay_ms(10);
  //ads1299_wake();
#endif
  // Start execution.
  application_timers_start();
  advertising_start(erase_bonds);
#if defined(BOARD_PCA10040)
  nrf_gpio_pin_clear(LED_3);
  nrf_gpio_pin_set(LED_4);
#endif
  int32_t eeg1 = 0x0000;
  int32_t eeg2 = 0x0000;
  int32_t eeg3 = 0x0000;
  int32_t eeg4 = 0x0000;
  NRF_LOG_INFO(" BLE Advertising Start! \r\n");
  // Enter main loop.
  for (;;) {
    if (NRF_LOG_PROCESS() == false) {
      power_manage();
      if (m_drdy) {
        //NRF_LOG_INFO("MDRDY TRIGGERED \r\n");
        m_drdy = false;
        //Acquire Data Samples
        get_eeg_voltage_samples(&eeg1, &eeg2, &eeg3, &eeg4);
        //        //Send 32-bit data samples to be organized into buffer
        ble_eeg_update_2ch(&m_eeg, &eeg1, &eeg2);
      }
    }
    
    //TODO: FIX THIS
  }
}
//NOTE: ORIG BELOW
/*
int main(void)
{
    bool erase_bonds;

    // Initialize.
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    conn_params_init();
    peer_manager_init();

    // Start execution.
    NRF_LOG_INFO("Template example started.\r\n");
    application_timers_start();

    advertising_start(erase_bonds);

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}
*/
/**
 * @}
 */